In [1]:
#Programmer : Gaykhe Punam Pandharinath
#College : Keystone school of engineering pune
#Class : TE COMP
#Roll No : 21
#Div : A

In [2]:
#pandas -> Data analyses
import pandas as pd
#numpy -> array operations
import numpy as np

# Array

In [3]:
num = np.array([34,12,37,65,48,79,15])

In [4]:
num

array([34, 12, 37, 65, 48, 79, 15])

In [5]:
type(num)

numpy.ndarray

In [6]:
num.dtype

dtype('int32')

# Series

In [7]:
s=pd.Series([45,12,38,75,19,36])

In [8]:
s

0    45
1    12
2    38
3    75
4    19
5    36
dtype: int64

In [9]:
type(s)

pandas.core.series.Series

In [10]:
s.dtype

dtype('int64')

In [11]:
s.size

6

In [12]:
s.shape

(6,)

# Dataframes

In [13]:
r = pd.Series([1,2,3,4,5])
n = pd.Series(['prem','raj','kiran','piya','radha'])
m = pd.Series([67.89,73.57,71.57,67.34,66.66])

In [14]:
df = pd.DataFrame({
    'roll' : r,
    'name' : n,
    'marks' : m
})

In [15]:
df

   roll   name  marks
0     1   prem  67.89
1     2    raj  73.57
2     3  kiran  71.57
3     4   piya  67.34
4     5  radha  66.66

In [16]:
type(df)

pandas.core.frame.DataFrame

In [17]:
df.shape

(5, 3)

In [18]:
df.size

15

In [19]:
df.dtypes

roll       int64
name      object
marks    float64
dtype: object

# Structures Data Analysis

In [20]:
#Download all the datasets whose name starts with students...
#from below link & store in current working directory
#https://mitu.co.in/dataset

In [21]:
import os
os.getcwd()

'C:\\Users\\Sachin\\Downloads\\poonaminterns'

# Import the Data

In [22]:
df = pd.read_csv('student.csv')

In [23]:
df

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [24]:
cols=['A','B','C','D','E']

In [25]:
df3 = pd.read_csv('student3.csv')

In [26]:
#read from link
df2 = pd.read_csv('https://gist.githubusercontent.com/justimchung/9b98c69b30600a46daa6d2e827c31b56/raw/4b1f08ba9b00a2fcd3f7ced9cf9e59062f489c3a/student.csv')

In [27]:
df2

  Unnamed: 0    Name  height  weight  sex       bdate       city major
0   s1234567   Peter   175.0   70.45    1   1980/4/30     Tainan  CSIE
1   e1234567    Mary   163.0   55.00    2  1981/12/21     Taipei    EE
2   f1357689    John   180.4   80.30    1   1980/5/30     Tainan  Stat
3   e1374659   Keven   182.5   77.60    1  1980/11/19     Taipei    EE
4   s7758347    JoJo   170.3   50.30    2   1980/1/27     Taipei  CSIE
5   s1334987   Emily   168.5   53.60    2  1982/10/13  Kaohsiung  CSIE
6   e1384726  Ubuntu   177.0   68.30    1    1981/7/6  Kaohsiung    EE

# Using the Dataframes object attributes

In [28]:
df.shape

(10, 5)

In [29]:
df.size

50

In [30]:
df.columns

Index(['roll', 'name', 'class', 'marks', 'age'], dtype='object')

In [31]:
df.dtypes

roll       int64
name      object
class     object
marks    float64
age        int64
dtype: object

In [32]:
df.ndim

2

In [33]:
df.index

RangeIndex(start=0, stop=10, step=1)

In [34]:
df.T

,0,1,2,3,4,5,6,7,8,9
roll,1,2,3,4,5,6,7,8,9,10
name,anil,amit,aniket,ajinkya,asha,ayesha,amar,amita,amol,anmol
class,TE,TE,BE,TE,TE,BE,BE,BE,TE,BE
marks,56.77,59.77,76.88,69.66,63.28,49.55,65.34,68.33,56.75,78.66
age,22,21,19,20,20,20,19,23,20,21

In [35]:
df.head()

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20

In [36]:
df.tail()

   roll    name class  marks  age
5     6  ayesha    BE  49.55   20
6     7    amar    BE  65.34   19
7     8   amita    BE  68.33   23
8     9    amol    TE  56.75   20
9    10   anmol    BE  78.66   21